[GraphicalObject]
Name=Lib
Path=
Title=
WndStyle=TOOLBAR
PosStyle=LEFT
X=0
Y=0
Width=54
Height=1200
FrameThickness=0
Activate=0
EraseBk=0
Set0=
RC-DLL=HPCor008.DLL

[ToolDescriptor]
1 = SepLine1 , GROUPFRAME , hpgbut02.dll
2 = SepLine2 , GROUPFRAME , hpgbut02.dll
3 = Title , RADIOBUTTON , hpgbut02.dll
4 = InfoLib , PUSHBUTTON , hpgbut02.dll
5 = PrintLib , PUSHBUTTON , hpgbut02.dll
6 = CloseLib , PUSHBUTTON , hpgbut02.dll
7 = EditEntry , PUSHBUTTON , hpgbut02.dll
8 = AddEntry , PUSHBUTTON , hpgbut02.dll
9 = SearchSpec , PUSHBUTTON , hpgbut02.dll
10 = EditSearch , PUSHBUTTON , hpgbut02.dll
11 = AddOnButton1 , PUSHBUTTON , hpgbut02.dll
12 = AddOnButton2 , PUSHBUTTON , hpgbut02.dll

[GROUPFRAME SepLine1]
x=53
y=0
width=1
height=1200
Help=
Color=0,0,0
FrameThickness=0

[GROUPFRAME SepLine2]
x=0
y=0
width=56
height=4
Help=
FrameThickness=2

[RadioButton Title]
ImageList=RBMP.SpectrumLibraryTitle|RBMP.SpectrumLibraryTitle|RBMP.SpectrumLibraryTitle|RBMP.SpectrumLibraryTitle|
State=3
Enable=0
x=6
y=0
width=40
height=40
Help=
FrameThickness=0

[PushButton InfoLib]
ImageList=RBMP.LIBRARYEDITHEADER|RBMP.LIBRARYEDITHEADER|RBMP.LIBRARYEDITHEADER_Disable|
x=6
y=48
width=40
height=40
Command=SPC_TLBFunction InfoLib
Help=現在のライブラリの一般情報を編集します
FrameThickness=2

[PushButton PrintLib]
ImageList=RBMP.PRINT|RBMP.PRINT|RBMP.PRINT_Disable|
x=6
y=88
width=40
height=40
Command=SPC_TLBFunction PrintLib
Help=選択したライブラリ エントリを印刷します
FrameThickness=2

[PushButton CloseLib]
ImageList=RBMP.LIBRARYCLOSE|RBMP.LIBRARYCLOSE|RBMP.LIBRARYCLOSE_Disable|
x=6
y=128
width=40
height=40
Command=SPC_TLBFunction CloseLib
Help=現在のスペクトル ライブラリを閉じます
FrameThickness=2

[PushButton EditEntry]
ImageList=RBMP.LIBRARYMANAGER|RBMP.LIBRARYMANAGER|RBMP.LIBRARYMANAGER_Disable|
x=6
y=172
width=40
height=40
Command=SPC_TLBFunction EditEntry
Help=現在のライブラリのスペクトル エントリを変更します
FrameThickness=2

[PushButton AddEntry]
ImageList=RBMP.LIBRARYADDSPECTRUM|RBMP.LIBRARYADDSPECTRUM|RBMP.LIBRARYADDSPECTRUM_Disable|
x=6
y=212
width=40
height=40
Command=SPC_TLBFunction AddEntry
Help=現在のライブラリにスペクトル エントリを追加します
FrameThickness=2

[PushButton SearchSpec]
ImageList=RBMP.LIBRARYSEARCH|RBMP.LIBRARYSEARCH|RBMP.LIBRARYSEARCH_Disable|
x=6
y=256
width=40
height=40
Command=SPC_TLBFunction SearchSpec
Help=現在のライブラリでスペクトルを検索します
FrameThickness=2

[PushButton EditSearch]
ImageList=RBMP.LIBRARYSEARCHOPTIONS|RBMP.LIBRARYSEARCHOPTIONS|RBMP.LIBRARYSEARCHOPTIONS_Disable|
x=6
y=296
width=40
height=40
Command=SPC_TLBFunction EditSearch
Help=ライブラリ サーチで使用する検索テンプレートを編集します
FrameThickness=2

[PushButton AddOnButton1]
x=6
y=-999 ; 340
width=40
height=40
FrameThickness=2
Command=

[PushButton AddOnButton2]
x=6
y=-999 ; 380
width=40
height=40
FrameThickness=2
Command=

